Invalid parent relationship for a Displacement element. No cycles are allowed.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId DetectedCycleInDisplacedElementParents { get; }
  Visual Basic
Public Shared ReadOnly Property DetectedCycleInDisplacedElementParents As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ DetectedCycleInDisplacedElementParents {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DisplacementElementFailures Class
  Autodesk.Revit.DB Namespace